
 #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитВТГНаСервере()
	ВКМ_Telegram.ОтправкаУведомленийВТГ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	Элементы.Список.Обновить();
КонецПроцедуры


#КонецОбласти
//@skip-check module-structure-top-region
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитВТГ(Команда)
	ОтправитВТГНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти


