#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес); 
	
	 Для каждого Элемент Из ОтпускаСотрудников Цикл
    
    	 Точка = АнализОтпусков.УстановитьТочку(Элемент.Имя); 
         Серия = АнализОтпусков.УстановитьСерию("Отпуск"); 
         ЗначениеДГ = АнализОтпусков.ПолучитьЗначение(Точка, Серия);  
               
         Интервал = ЗначениеДГ.Добавить(); 
         Интервал.Начало = Элемент.Начало; 
         Интервал.Конец = Элемент.Конец; 

	 КонецЦикла;   

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметры()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ОтпускаСотрудниковДанные = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		
		СотрудникСтруктура = Новый Структура;
		СотрудникСтруктура.Вставить("Имя",Выборка.Сотрудник);
		СотрудникСтруктура.Вставить("Начало" ,Выборка.ДатаНачала);
		СотрудникСтруктура.Вставить("Конец" , Выборка.ДатаОкончания);
		ОтпускаСотрудниковДанные.Добавить(СотрудникСтруктура); 
    КонецЦикла;
	
		
	Возврат ОтпускаСотрудниковДанные;

КонецФункции


#КонецОбласти
