#Область СлужебныеПроцедурыИФункции

	
Процедура ВКМ_ОтправкаУведомленийВТГ() Экспорт
  Запрос = Новый Запрос;
   Запрос.Текст =
   	"ВЫБРАТЬ
   	|	ВКМ_УведомленияТелеграммБоту.Текст,
   	|	ВКМ_УведомленияТелеграммБоту.Ссылка,
   	|	ВКМ_ТелеграмТокен.Значение КАК ТокенТГ,
   	|	ВКМ_ИдентификаторГруппыДляОповещения.Значение КАК Chat_id
   	|ИЗ
   	|	Справочник.ВКМ_УведомленияТелеграммБоту КАК ВКМ_УведомленияТелеграммБоту,
   	|	Константа.ВКМ_ТелеграмТокен КАК ВКМ_ТелеграмТокен,
   	|	Константа.ВКМ_ИдентификаторГруппыДляОповещения КАК ВКМ_ИдентификаторГруппыДляОповещения";
   
   РезультатЗапроса = Запрос.Выполнить();
   
   Выборка = РезультатЗапроса.Выбрать();
   
   Пока Выборка.Следующий() Цикл
    	Токен = Выборка.ТокенТГ;
    	Chat_id = Выборка.Chat_id;
    	ТекстСообщения = Выборка.Текст;
        АдресТГ = "api.telegram.org";

		Соединение = Новый HTTPСоединение(АдресТГ, 443, , , , ,Новый ЗащищенноеСоединениеOpenSSL( ));

		АдресЗапроса = "bot" 
                + Токен 
                + "/sendMessage"
                + "?chat_id=" 
                + Chat_id
                + "&text=" 
                + ТекстСообщения;
		ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса);
				
   Попытка
   		Результат = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
   		Объект = Выборка.Ссылка.ПолучитьОбъект();
   		Объект.Удалить(); 	
   Исключение
   		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
   		УровеньЖурналаРегистрации.Ошибка,,,
   		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
   КонецПопытки;     
   
   		Если Не Результат.КодСостояния = 200 Тогда
   			ВызватьИсключение "Ошибка проверка связи";
   		КонецЕсли;
   			
   			Возврат;
   
    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


