
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
    
#Область ОбработчикиСобытийМодуляОбъекта

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    Для каждого Строка Из ОтпускаСотрудников Цикл   
        
        Если ЗначениеЗаполнено (Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда 
            Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда  
                Сообщить(СтрШаблон("Неверно заполнен период в строке №%1", Строка.НомерСтроки)); 
                Отказ = Истина; 
            КонецЕсли; 
        КонецЕсли; 
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Набор = РегистрыСведений.ВКМ_ГрафикиОтпусков.СоздатьНаборЗаписей(); 
	Сутки = 60*60*24; 
	
	Для каждого Строка Из ОтпускаСотрудников Цикл
	    День = Строка.ДатаНачала; 
		Пока День < Строка.ДатаОкончания +1 Цикл
		   НоваяЗапись = Набор.Добавить(); 
		   НоваяЗапись.Дата = День; 
		   НоваяЗапись.Сотрудник = Строка.Сотрудник; 
		   НоваяЗапись.Значение = 1; 
		   День = День + Сутки; 
		КонецЦикла;
	КонецЦикла;    
	
	Набор.Записать(); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли