//!!Росоха С. Программно добавляю реквизиты на форму при изменении вида договора.!!

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			  Элементы.ПолеСуммы.Видимость 	 			= Истина;
    		  Элементы.ЧасРаботы.Видимость  	 		= Истина;
			  Элементы.ПолеПериодС.Видимость  			= Истина;
			  Элементы.ПолеПериодПо.Видимость 			= Истина;   
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВидДоговораПриИзмененииНаСервере() ;
	Элементы.ПолеСуммы.Видимость 	 			= Ложь;
    Элементы.ЧасРаботы.Видимость  	 			= Ложь;
	Элементы.ПолеПериодС.Видимость  			= Ложь;
	Элементы.ПолеПериодПо.Видимость 			= Ложь; 
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		      Элементы.ПолеСуммы.Видимость 	 			= Истина;
    		  Элементы.ЧасРаботы.Видимость  	 		= Истина;
			  Элементы.ПолеПериодС.Видимость  			= Истина;
			  Элементы.ПолеПериодПо.Видимость 			= Истина;   
		Иначе
			  Элементы.ПолеСуммы.Видимость 	 			= Ложь;
    		  Элементы.ЧасРаботы.Видимость  	 		= Ложь;
			  Элементы.ПолеПериодС.Видимость  			= Ложь;
			  Элементы.ПолеПериодПо.Видимость 			= Ложь;  	 
		КонецЕсли;
		
		     
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере 
Процедура ВидДоговораПриИзмененииНаСервере()
	
	ГруппаАбоненскаяПлата = Элементы.Добавить("ГруппаАбоненскаяПлата", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаАбоненскаяПлата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбоненскаяПлата.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаАбоненскаяПлата.ОтображатьЗаголовок = Ложь;
	ГруппаАбоненскаяПлата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	ДобавлениеРеквизитов = Элементы.Добавить("ПолеСуммы",Тип("ПолеФормы"),ГруппаАбоненскаяПлата );	
	ДобавлениеРеквизитов.Вид = ВидПоляФормы.ПолеВвода;
	ДобавлениеРеквизитов.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		
	ДобавлениеРеквизитовЧасРаботы = Элементы.Добавить("ЧасРаботы",Тип("ПолеФормы"),ГруппаАбоненскаяПлата );	
	ДобавлениеРеквизитовЧасРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ДобавлениеРеквизитовЧасРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		
	ГруппаДатаВремя = Элементы.Добавить("ГруппаДатаВремя", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаДатаВремя.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДатаВремя.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДатаВремя.ОтображатьЗаголовок = Ложь;
	ГруппаДатаВремя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	ПолеПериодС = Элементы.Добавить("ПолеПериодС",Тип("ПолеФормы"),ГруппаДатаВремя );	
	ПолеПериодС.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПериодС.ПутьКДанным = "Объект.ВКМ_ПериодС";
		
	ПолеПериодПо = Элементы.Добавить("ПолеПериодПо",Тип("ПолеФормы"),ГруппаДатаВремя );	
	ПолеПериодПо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПериодПо.ПутьКДанным = "Объект.ВКМ_По";
		
КонецПроцедуры

#КонецОбласти


